app/controllers/appointments_controller.rb

  def index
    if current_user.type == "Mentor"
      @appointments = Appointment.where(mentor_id: current_user.id)
    elsif
      @appointments = Appointment.all
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."mentor_id" = $1  [["mentor_id", 3]]
SELECT "appointments".* FROM "appointments"