app/controllers/appointments_controller.rb

  def index
    if current_user.type == "Mentor"
      @appointments = Appointment.where(mentor_id: current_user.id).where('datetime > ?', DateTime.now).order(datetime: :asc)
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."mentor_id" = $1 AND (datetime > '2016-05-05 23:17:13.823915')  ORDER BY "appointments"."datetime" ASC  [["mentor_id", 3]]

  def update
    @appointment = Appointment.find(params[:id])
    if @appointment.student != nil
      @appointment.update_attributes(student_id: nil)
---
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT 1  [["id", 19]]
UPDATE "appointments" SET "student_id" = $1, "updated_at" = $2 WHERE "appointments"."id" = $3  [["student_id", 2], ["updated_at", "2016-05-06 15:59:39.450615"], ["id", 19]]

  def show
    @appointment = Appointment.find(params[:id])
    @review = Review.new
    @student = @appointment.student
    @mentor = @appointment.mentor
    @reviews = @appointment.reviews
    @skills = @appointment.skills
    if @reviews.first
---
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."appointment_id" = $1  ORDER BY "reviews"."id" DESC LIMIT 1  [["appointment_id", 1]]

  def new
    @appointment = Appointment.new
    @skills = Skill.all
---
SELECT "skills".* FROM "skills"

  def create
    zone = ActiveSupport::TimeZone.new("Eastern Time (US & Canada)")
    Time.now.in_time_zone(zone)
    @datetime = Time.new(params[:appointment][:datetime][0..3], params[:appointment][:datetime][5..6], params[:appointment][:datetime][8..9], params[:appointment]["datetime(4i)"], params[:appointment]["datetime(5i)"]).in_time_zone(zone)
    @appointment = Appointment.new(datetime: @datetime, mentor_id: current_user.id)
    params[:appointment][:skills].select do |skill, value|
      if value == "1"
        @appointment.skills << Skill.where(name: skill)
      end
    end
    if @appointment.skills.empty?
---
SELECT  "appointments".* FROM "appointments"  ORDER BY "appointments"."id" ASC LIMIT 1
INSERT INTO "appointment_skills" ("skill_id", "appointment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["skill_id", 2], ["appointment_id", 7], ["created_at", "2016-05-05 20:35:34.949033"], ["updated_at", "2016-05-05 20:35:34.949033"]]
INSERT INTO "appointments" ("date", "time", "mentor_id", "student_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "2016-05-05"], ["time", "2016-05-05 19:47:57.972432"], ["mentor_id", 2], ["student_id", 1], ["created_at", "2016-05-05 19:48:01.459899"], ["updated_at", "2016-05-05 19:48:01.459899"]]
SELECT "skills".* FROM "skills" WHERE "skills"."name" = $1  [["name", "Ruby"]]
SELECT "skills".* FROM "skills" INNER JOIN "appointment_skills" ON "skills"."id" = "appointment_skills"."skill_id" WHERE "appointment_skills"."appointment_id" = $1  [["appointment_id", 1]]