app/controllers/reviews_controller.rb

  def create
    @review = Review.new(rating: params[:review][:rating], content: params[:review][:content])
    @review.author_id = current_user.id
    @review.appointment_id = params[:id]
    binding.pry
    if @review.save
---
INSERT INTO "reviews" ("rating", "content", "author_id", "appointment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["rating", 5], ["content", "liau;i"], ["author_id", 3], ["appointment_id", 9], ["created_at", "2016-05-05 23:50:04.199741"], ["updated_at", "2016-05-05 23:50:04.199741"]]