app/controllers/users_controller.rb

INSERT INTO "users" ("type", "first_name", "last_name", "email", "phone", "phase", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 13]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."mentor_id" = $1 AND (datetime < '2016-05-05 23:21:02.337510')  ORDER BY "appointments"."datetime" DESC  [["mentor_id", 3]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."mentor_id" = $1 AND "appointments"."student_id" = $2 AND (datetime < '2016-05-06 16:13:19.267874')  ORDER BY "appointments"."datetime" DESC  [["mentor_id", 3], ["student_id", 0]]
---
  def show
    @user = User.find_by(id: params[:id])
    if current_user.type == "Mentor"
      @appointments = Appointment.where(mentor_id: current_user.id).where("datetime < ?", DateTime.now).order(datetime: :desc)
    elsif current_user.type == "Student"
      @appointments = Appointment.where(student_id: current_user.id).where("datetime < ?", DateTime.now).order(datetime: :desc)