app/controllers/users_controller.rb

  def show
    @user = User.find_by(id: params[:id])
    @appointments = Appointment.where(mentor_id: current_user.id).where("datetime < ?", Date.today)
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."mentor_id" = $1 AND (date < '2016-05-06')  [["mentor_id", 3]]