app/views/appointments/show.html.erb

SELECT  "skills".* FROM "skills" INNER JOIN "appointment_skills" ON "skills"."id" = "appointment_skills"."skill_id" WHERE "appointment_skills"."appointment_id" = $1  ORDER BY "skills"."id" ASC LIMIT 1  [["appointment_id", 1]]
---
  Time: <%= @appointment.time %><br>
  Skills: <%= @appointment.skills.first.name %>